In [52]:
# Importing necessary libaries

import numpy as np
import pandas as pd

In [75]:
# Importing the datasets

Pesticides = pd.read_csv("C:/Users/USER/Desktop/TechCrush/pesticides.csv")
Rainfall = pd.read_csv("C:/Users/USER/Desktop/TechCrush/rainfall.csv")
Temperature = pd.read_csv("C:/Users/USER/Desktop/TechCrush/temp.csv")
Yield = pd.read_csv("C:/Users/USER/Desktop/TechCrush/yield.csv")
Crop_Yield = pd.read_csv("C:/Users/USER/Desktop/TechCrush/yield_df.csv")

## DATA CLEANNG AND MANIPULATION

### Pesticide Dataset

In [54]:
# Display the first five rows of the Pesticides DataFrame

Pesticides.head()

,Domain,Area,Element,Item,Year,Unit,Value
0,Pesticides Use,Albania,Use,Pesticides (total),1990,tonnes of active ingredients,121.0
1,Pesticides Use,Albania,Use,Pesticides (total),1991,tonnes of active ingredients,121.0
2,Pesticides Use,Albania,Use,Pesticides (total),1992,tonnes of active ingredients,121.0
3,Pesticides Use,Albania,Use,Pesticides (total),1993,tonnes of active ingredients,121.0
4,Pesticides Use,Albania,Use,Pesticides (total),1994,tonnes of active ingredients,201.0

In [55]:
# Display summary information about the Pesticides DataFrame

Pesticides.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4349 entries, 0 to 4348
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Domain   4349 non-null   object
 1   Area     4349 non-null   object
 2   Element  4349 non-null   object
 3   Item     4349 non-null   object
 4   Year     4349 non-null   int64
 5   Unit     4349 non-null   object
 6   Value    4349 non-null   float64
dtypes: float64(1), int64(1), object(5)
memory usage: 238.0+ KB

### Rainfall Dataset

In [74]:
# Display the first five rows of the Rainfall DataFrame

Rainfall.head()

          Area  Year  average_rain_fall_mm_per_year
0  Afghanistan  1985                          327.0
1  Afghanistan  1986                          327.0
2  Afghanistan  1987                          327.0
3  Afghanistan  1989                          327.0
4  Afghanistan  1990                          327.0

In [58]:
# Display summary information about the Rainfall DataFrame

Rainfall.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6727 entries, 0 to 6726
Data columns (total 3 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0    Area                          6727 non-null   object
 1   Year                           6727 non-null   int64
 2   average_rain_fall_mm_per_year  5953 non-null   object
dtypes: int64(1), object(2)
memory usage: 157.8+ KB

In [59]:
# Check for total number of missing values

Rainfall.isna().sum()

 Area                              0
Year                               0
average_rain_fall_mm_per_year    774
dtype: int64

In [60]:
# Convert the 'average_rain_fall_mm_per_year' column from 'string datatype' to 'numeric datatype'

Rainfall["average_rain_fall_mm_per_year"] = pd.to_numeric(Rainfall["average_rain_fall_mm_per_year"], errors='coerce')

In [61]:
# Calculate the skewness of the 'average_rain_fall_mm_per_year' column to understand its distribution shape

Rainfall["average_rain_fall_mm_per_year"].skew()

0.6970011268208575

In [62]:
# Fill missing values in 'average_rain_fall_mm_per_year' with the median values since distribution is skewed to the right

Rainfall["average_rain_fall_mm_per_year"] = Rainfall["average_rain_fall_mm_per_year"].fillna(Rainfall["average_rain_fall_mm_per_year"].median())

### Temperature Dataset

In [63]:
# Display the first five rows of the Temperature DataFrame

Temperature.head()

   year        country  avg_temp
0  1849  Côte D'Ivoire     25.58
1  1850  Côte D'Ivoire     25.52
2  1851  Côte D'Ivoire     25.67
3  1852  Côte D'Ivoire       NaN
4  1853  Côte D'Ivoire       NaN

In [64]:
# Display summary information about the Temperature DataFrame

Temperature.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71311 entries, 0 to 71310
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   year      71311 non-null  int64
 1   country   71311 non-null  object
 2   avg_temp  68764 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

In [65]:
# Check for total number of missing values

Temperature.isna().sum()

year           0
country        0
avg_temp    2547
dtype: int64

In [71]:
# Drop the 'avg_temp' column due to excessive missing value

Temperature.drop(columns=["avg_temp"], inplace=True)

### Yield Dataset

In [66]:
# Display the first five rows of the Yield DataFrame

Yield.head

<bound method NDFrame.head of       Domain Code Domain  Area Code         Area  Element Code Element  \
0              QC  Crops          2  Afghanistan          5419   Yield
1              QC  Crops          2  Afghanistan          5419   Yield
2              QC  Crops          2  Afghanistan          5419   Yield
3              QC  Crops          2  Afghanistan          5419   Yield
4              QC  Crops          2  Afghanistan          5419   Yield
...           ...    ...        ...          ...           ...     ...
56712          QC  Crops        181     Zimbabwe          5419   Yield
56713          QC  Crops        181     Zimbabwe          5419   Yield
56714          QC  Crops        181     Zimbabwe          5419   Yield
56715          QC  Crops        181     Zimbabwe          5419   Yield
56716          QC  Crops        181     Zimbabwe          5419   Yield

       Item Code   Item  Year Code  Year   Unit  Value
0             56  Maize       1961  1961  hg/ha  14000
1             56  Maize       1962  1962  hg/ha  14000
2             56  Maize       1963  1963  hg/ha  14260
3             56  Maize       1964  1964  hg/ha  14257
4             56  Maize       1965  1965  hg/ha  14400
...          ...    ...        ...   ...    ...    ...
56712         15  Wheat       2012  2012  hg/ha  24420
56713         15  Wheat       2013  2013  hg/ha  22888
56714         15  Wheat       2014  2014  hg/ha  21357
56715         15  Wheat       2015  2015  hg/ha  19826
56716         15  Wheat       2016  2016  hg/ha  18294

[56717 rows x 12 columns]>

In [67]:
# Display summary information about the Yield DataFrame

Yield.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56717 entries, 0 to 56716
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Domain Code   56717 non-null  object
 1   Domain        56717 non-null  object
 2   Area Code     56717 non-null  int64
 3   Area          56717 non-null  object
 4   Element Code  56717 non-null  int64
 5   Element       56717 non-null  object
 6   Item Code     56717 non-null  int64
 7   Item          56717 non-null  object
 8   Year Code     56717 non-null  int64
 9   Year          56717 non-null  int64
 10  Unit          56717 non-null  object
 11  Value         56717 non-null  int64
dtypes: int64(6), object(6)
memory usage: 5.2+ MB

### Crop_Yield Dataset

In [77]:
# Display the first five rows of the Yield_df DataFrame

Crop_Yield.head

<bound method NDFrame.head of        Unnamed: 0      Area            Item  Year  hg/ha_yield  \
0               0   Albania           Maize  1990        36613
1               1   Albania        Potatoes  1990        66667
2               2   Albania     Rice, paddy  1990        23333
3               3   Albania         Sorghum  1990        12500
4               4   Albania        Soybeans  1990         7000
...           ...       ...             ...   ...          ...
28237       28237  Zimbabwe     Rice, paddy  2013        22581
28238       28238  Zimbabwe         Sorghum  2013         3066
28239       28239  Zimbabwe        Soybeans  2013        13142
28240       28240  Zimbabwe  Sweet potatoes  2013        22222
28241       28241  Zimbabwe           Wheat  2013        22888

       average_rain_fall_mm_per_year  pesticides_tonnes  avg_temp
0                             1485.0             121.00     16.37
1                             1485.0             121.00     16.37
2                             1485.0             121.00     16.37
3                             1485.0             121.00     16.37
4                             1485.0             121.00     16.37
...                              ...                ...       ...
28237                          657.0            2550.07     19.76
28238                          657.0            2550.07     19.76
28239                          657.0            2550.07     19.76
28240                          657.0            2550.07     19.76
28241                          657.0            2550.07     19.76

[28242 rows x 8 columns]>

In [78]:
# Display summary information about the Yield_df DataFrame

Crop_Yield.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28242 entries, 0 to 28241
Data columns (total 8 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   Unnamed: 0                     28242 non-null  int64
 1   Area                           28242 non-null  object
 2   Item                           28242 non-null  object
 3   Year                           28242 non-null  int64
 4   hg/ha_yield                    28242 non-null  int64
 5   average_rain_fall_mm_per_year  28242 non-null  float64
 6   pesticides_tonnes              28242 non-null  float64
 7   avg_temp                       28242 non-null  float64
dtypes: float64(3), int64(3), object(2)
memory usage: 1.7+ MB

In [79]:
# Drop the 'Unnamed' column since it is a duplicate of the index

Crop_Yield.drop(columns=["Unnamed: 0"], inplace=True)